{"config": [{"config": {"dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e9\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-24-8bf49451b15d>\u00da\b<lambda>\t\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "function_type": "lambda", "batch_input_shape": [null, 66, 200, 3], "output_shape": null, "name": "lambda_1", "output_shape_type": "raw", "arguments": {}}, "class_name": "Lambda"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "filters": 3, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "name": "color_conv"}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "filters": 24, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [5, 5], "name": "conv1"}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "filters": 36, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [5, 5], "name": "conv2"}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "filters": 48, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [5, 5], "name": "conv3"}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "filters": 64, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "name": "conv4"}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "filters": 64, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "name": "conv5"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "kernel_constraint": null, "use_bias": true, "name": "dense1"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 20, "kernel_constraint": null, "use_bias": true, "name": "dense2"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "kernel_constraint": null, "use_bias": true, "name": "output"}, "class_name": "Dense"}], "keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow"}