{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"dtype": "float32", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-40-6362a33c05f8>\u00da\b<lambda>\n\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "arguments": {}, "batch_input_shape": [null, 66, 200, 3], "name": "lambda_7", "trainable": true, "function_type": "lambda"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 32, "kernel_constraint": null, "name": "conv2d_6", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_19", "rate": 0.1, "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64, "kernel_constraint": null, "name": "conv2d_7", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_20", "rate": 0.1, "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 128, "kernel_constraint": null, "name": "conv2d_8", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 256, "kernel_constraint": null, "name": "conv2d_9", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_4", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_7", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_5", "activation": "linear", "bias_constraint": null, "units": 120, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_6", "activation": "linear", "bias_constraint": null, "units": 20, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_7", "activation": "linear", "bias_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.0.8"}